Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ལ་གནས་པ་མ་ཡིན། ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་གནས་པ་མ་ཡིན།
en: It is not blameworthy, nor is it blameless.

source: ཟག་པ་དང་བཅས་པ་ལ་གནས་པ་མ་ཡིན། ཟག་པ་མེད་པ་ལ་གནས་པ་མ་ཡིན།
en: It is not defiled, nor is it undefiled.

source: འདས་པ་ལ་གནས་པ་མ་ཡིན། མ་འོངས་པ་ལ་གནས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་ལ་གནས་པ་མ་ཡིན།
en: It is not situated in the past, nor is it situated in the future, nor is it situated in the present.

source: སོ་སོར་བརྟགས་པ་ལ་གནས་པ་མ་ཡིན། སོ་སོར་བརྟགས་པ་མ་ཡིན་པ་ལ་གནས་པ་མ་ཡིན་ཏེ།
en: It is not based on enumerative analysis, nor does it come from a lack of enumeration.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གནས་པ་མི་མངའོ། །
en: In this way, Śāntamati, a realized one is one whose knowledge has no foundation.

source: དེ་ཆོས་གང་ཡང་མངོན་པར་མི་སྒྲུབ་ལ་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་དང་། བསམ་པ་རྣམས་ལ་ཡང་དེའི་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མི་མངའ་ཞིང་ཐོགས་པ་མི་མངའ་བ་འཇུག་སྟེ། དེ་ཡང་ལྷུན་གྱིས་གྲུབ་ཅིང་བསྒྲིམ་པ་མི་མངའ་ལ་མངོན་པར་འདུ་བྱ་བ་མི་མངའ་བས་འཇུག་གོ །
en: Without undertaking anything whatsoever, but out of compassion for beings, his knowledge and vision of the thoughts, actions, and motivations of all beings arises without attachment or impediment, and this happens effortlessly, spontaneously, and without fabrication.

source: ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་གསང་བ་སྟེ། མཉམ་པར་བཞག་པའི་གནས་ཀྱང་མི་འདོར་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་རིག་པར་ཡང་མཛད་པས་ཐུགས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དོ། །
en: “This, Śāntamati, is the secret of a realized one’s mind and the inconceivable nature of his thoughts—he does not leave the state of meditative concentration, but he meets the demands of all beings.

source: དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་གསང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་དགུ་པའོ།། །།
en: This was the ninth chapter, “The Secret of the Realized One’s Mind.” Chapter 10: Celebrating the Virtues of Vajrapāṇi, Lord of the Guhyakas

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāriputra then spoke to the Blessed One: “Throughout the ten directions, Blessed One, bodhisattvas of this Fortunate Eon are leading the holy life in the presence of blessed buddhas.

source: བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུ་དག་ན་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐད་ན་ད་ལྟར་ཚངས་པར་སྤྱད་པ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱི་སླད་ན་ཡང་གསང་བ་པའི་བདག་པོ་མཆིས་ལགས་སམ།
en: Is there a Lord of the Guhyakas standing behind all these bodhisattvas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་བྱ་བ་འདི་བསམ་གྱིས་མི་ཁྱབ་ཀྱིས་ཞོག་ཤིག །
en: The Blessed One responded, “Enough, Śāriputra, such activity is inconceivable.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལ་མགོ་རྨོངས་པར་འགྱུར་རོ། །
en: The world including its gods would fall into confusion about the conduct of the bodhisattvas.

source: དེ་ལྟ་མོད་ཀྱི་ཤཱ་རིའི་བུ་གང་དག་དད་ཅིང་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་དེ་དག་གནས་འདི་ལ་སྐྲག་པར་མི་འགྱུར་རོ། །
en: Nevertheless, Śāriputra, those who have faith will be embraced by companions in what is good and will not worry about this subject at all.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “Blessed One, please explain this.

source: བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཡིད་ཆེས་པར་མཆིའོ། །
en: I would trust the Realized One.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་རྟག་ཏུ་ངའི་ཕྱི་བཞིན་འབྲང་བ་མཐོང་ངམ།
en: “Śāriputra, do you see my constant companion, Vajrapāṇi, Lord of the Guhyakas?” asked the Blessed One.

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས་མཐོང་ལགས་ཏེ།
en: “I can see him, Blessed One, through the majestic power of the Buddha.

source: འདི་བདག་གིས་སྔོན་ནི་ནམ་ཡང་མ་མཐོང་ངོ་། །བཀའ་སྩལ་པ།
en: I have never seen him before.”

source: ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱབ་རྒྱབ་ན་ཡང་གནས་ཏེ་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་དང་།
en: “In precisely the same way, Śāriputra, this Vajrapāṇi, Lord of the Guhyakas, stands behind each and every bodhisattva of this Fortunate Eon.

source: མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཐམས་ཅད་དུ་ཡང་ལག་ན་རྡོ་རྗེའི་གཟུགས་སུ་ཀུན་དུ་སྟོན་ཏོ། །
en: Through his former vow and the power of his supernormal faculties, he appears in the likeness of Vajrapāṇi everywhere.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་འཁོད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་རྒྱབ་རྒྱབ་ཏུ། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ལག་ན་རྡོ་རྗེའི་གཟུགས་ཀུན་དུ་བསྟན་ཀྱང་དེས་ཡེ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་ཡོངས་སུ་རྫོགས་པར་བསྟན་པར་མི་འགྱུར་རོ། །
en: As many beings as there are throughout this cosmos of a billion worlds, Śāriputra, behind each and every one of those beings Vajrapāṇi, Lord of the Guhyakas, could appear in the likeness of Vajrapāṇi, and his appearance would not thereby exhaust his knowledge and empowerment.

source: ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་རྒྱབ་ན་ལག་ན་རྡོ་རྗེ་འདུག་པ་མཐོང་ངམ།
en: Śāriputra, do you see Vajrapāṇi standing behind the bodhisattva Maitreya?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ད་གདོད་མཐོང་ལགས་ཏེ།
en: “Blessed One, I see him now.

source: སྔོན་ནི་མ་མཐོང་ངོ་། །བཀའ་སྩལ་པ།
en: He wasn’t visible to me at first.”

source: འདི་ནི་དེའི་རྒྱབ་ན་རྟག་ཏུ་གནས་ན་ཁྱོད་ཀྱིས་དེ་མ་མཐོང་བ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའ་འམ།
en: “He is always truly standing behind him; you simply do not see him.

source: བརྒྱ་བྱིན་ནམ། ཚངས་པ་འམ། འཇིག་རྟེན་སྐྱོང་བ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་ནས་ལྷགས་པ་དེ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་རྒྱབ་ན་ལག་ན་རྡོ་རྗེ་རྡོ་རྗེ་ཐོགས་ཤིང་རྟག་ཏུ་འདུག་པར་མཐོང་ངོ་། །
en: By contrast, the bodhisattvas, śakras, brahmās, and lokapālas who come from other worlds see Vajrapāṇi always standing behind the bodhisattva Maitreya, with a vajra in his hand.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་སྤྲུལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་སྤྲུལ་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་རྒྱབ་ན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་གནས་པར་སྣང་སྟེ་བྱིན་གྱི་རླབས་དེ་དག་ཐམས་ཅད་ནི་གསང་བ་པའི་བདག་པོའི་ཡིན་ནོ། །
en: At this moment and time, Śāriputra, the bodhisattva Maitreya, and all the other bodhisattvas of this Fortunate Eon, magically create hundreds of thousands of millions and billions of magically created forms, and behind each and every one of them, too, stands Vajrapāṇi, Lord of the Guhyakas.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་གང་ཡིན་པ་དེ་དག་གི་རྒྱབ་ན་ཡང་འདིའི་བྱིན་གྱི་རླབས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་གནས་ཏེ།
en: All of this is the empowering authority of that Lord of the Guhyakas alone. What is more, Śāriputra, Vajrapāṇi, Lord of the Guhyakas, also stands behind the magically created forms that are magically created by the Realized One, and this, too, is due to his very own empowering authority.

source: ཤཱ་རིའི་བུ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ནི་དེ་ལྟར་ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་དང་ལྡན་ནོ། །
en: In this manner, Śāriputra, Vajrapāṇi, Lord of the Guhyakas, is endowed with inconceivable power, empowering authority, supernormal faculties, and knowledge.”

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་པའོ།། །།དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: This was the tenth chapter, “Celebrating the Virtues of Vajrapāṇi, Lord of the Guhyakas.”

source: གསང་བ་པའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་དཀའ་བ་སྤྱོད་པ་དང་།
en: Chapter 11: The Exalted Nature of the Severe Ascetic Practices: The Method of Acquiring Food to Bring Beings to Maturity

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་འདུལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བཀོད་པ་བསྟན་པ་ལས་བརྩམས་ཏེ། དེ་ན་རྨད་དུ་བྱུང་བའི་རྒྱུ་གང་དག་བྱུང་བ་གང་དུ་ཁྱོད་ལ་མངོན་སུམ་དུ་གྱུར་པ་ལ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: The bodhisattva Śāntamati then requested Vajrapāṇi, Lord of the Guhyakas, “Please use your inspired eloquence, Lord of the Guhyakas, to shine light on those occurrences that were the causes of wonders, beginning with a description of the splendid array of the Bodhisattva’s severe ascetic practices, his arrival at the seat of awakening, his defeat of Māra, and his turning of the wheel of Dharma, all of which you have witnessed.”

source: གསང་བ་པའི་བདག་པོས་སྨྲས་པ།
en: When this was said, Vajrapāṇi, Lord of the Guhyakas, responded to the bodhisattva Śāntamati.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བཀོད་པ་བྱུང་བ་ནི་ཚད་མེད་དེ།
en: “Śāntamati,” he said, “the splendid array of the Bodhisattva’s virtues is immeasurable.

source: དེ་དག་ནི་ཚེའི་ཚད་བསྐལ་པར་གནས་པས་ཀྱང་རྒྱས་པར་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་སླ་བ་མ་ཡིན་མོད་ཀྱི།
en: It would not be easy for me to describe them in full or in detail if I were to use the whole length of my life, even if it were to last for an eon.

source: འོན་ཀྱང་ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་པར་བྱའོ། །
en: However, I could gesture at them to some extent.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་དཀའ་བ་སྤྱོད་པ་ནི་རྣམ་པ་གཅིག་མ་ཡིན་ཏེ།
en: “Moreover, Śāntamati, the severe ascetic practices of the Bodhisattva were not of a single type.

source: མུ་སྟེགས་ཅན་གཞོམ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་དོ། །དཀའ་ཐུབ་དང་། ལུས་ལ་ཡོངས་སུ་གདུང་བ་ཇི་སྙེད་དང་།
en: In order to defeat the rival teachers and their followers, the Bodhisattva undertook various vows, physical austerities, and physical postures.

source: ལུས་ཀྱི་སྤྱོད་ལམ་ཇི་སྙེད་ཀྱིས་ཕ་རོལ་མུ་སྟེགས་ཅན་དག་མངོན་པར་སྙེམས་པ་དེ་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་པའམ། ཆེས་མཆོག་ཏུ་གྱུར་པའི་བྱ་དཀའ་བ་དང་། བརྟུལ་ཞུགས་དང་།
en: The rival teachers and their followers longed to undertake them, too, but the austerities were so intense, so extreme, and so severe that they were unable actively to display them.

source: དཀའ་ཐུབ་གང་དག་དེ་དག་གིས་བྱ་བས་ཀུན་ཏུ་བསྟན་པར་མི་ནུས་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་ཀུན་ཏུ་བསྟན་ཏེ། །
en: However, they were all displayed by the Bodhisattva.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྐང་པ་ཡ་གཅིག་བཙུགས་ཏེ། འདུག་པར་མཐོང་།
en: “In this respect, Śāntamati, some beings saw the Bodhisattva standing on one leg.

source: ཁ་ཅིག་གིས་ནི་ལག་པ་བཏེག་སྟེ་འདུག་པར་མཐོང་།
en: Some saw him standing with one arm raised above his head.

source: ཁ་ཅིག་གིས་ནི་ཉི་མ་ལ་ལྟ་ཞིང་འདུག་པར་མཐོང་།
en: Some saw him staring at the sun.

source: ཁ་ཅིག་གིས་ནི་གདུང་བ་ལྔས་གདུང་བར་མཐོང་། །
en: Some saw him practicing the austerity of the five fires.

source: ཁ་ཅིག་གིས་ནི་ཙོག་ཙོག་པོར་འདུག་ཅིང་སྤོང་བ་ལ་སྦྱོར་བར་བརྩོན་པར་མཐོང་།
en: Some saw him engaged in the ascetic practice of standing without ever sitting down.

source: ཁ་ཅིག་གིས་ནི་རྐང་པ་བཙུགས་ཏེ་མི་འགུལ་བར་མཐོང་།
en: Some saw him standing without moving.

source: ཁ་ཅིག་གིས་ནི་རྐང་པ་གྱེན་དུ་བསྒྲེང་སྟེ་འདུག་པར་མཐོང་།
en: Some saw him standing with one leg held aloft.

source: ཁ་ཅིག་གིས་ནི་ཁས་བུབ་ཏུ་འདུག་པར་མཐོང་།
en: Some saw him standing on his head.

source: ཁ་ཅིག་གིས་ནི་ཚེར་མའི་སྟེང་ན་ཉལ་བར་མཐོང་།
en: Some saw him lying on a bed of thorns.

source: ཁ་ཅིག་གིས་ནི་བ་ལང་གི་ལྕི་བའི་ནང་ན་ཉལ་བར་མཐོང་།
en: Some saw him lying on a bed of cow dung.

source: ཁ་ཅིག་གིས་ནི་རྡོ་ལེབ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་པར་མཐོང་།
en: Some saw him sitting on a seat of stone.

source: ཁ་ཅིག་གིས་ནི་རྩིག་པ་ལ་སྙེས་པ་དང་།
en: Some saw him lying on a bed of reeds.

source: ཁ་ཅིག་གིས་ནི་ཤིང་ལེབ་ལ་སྙེས་པ་དང་།
en: Some saw him lying on a bed of wooden boards.

source: ཁ་ཅིག་གིས་ནི་གཏུན་ཤིང་ལ་སྙེས་པ་དང་།
en: Some saw him lying on a bed of pestles.

source: ཁ་ཅིག་གིས་ནི་ཕྱག་དར་ཁྲོད་ན་ཉལ་བ་དང་།
en: Some saw him lying on a bed of dust.

source: ཁ་ཅིག་གིས་ནི་ཉི་མ་ཡོངས་སུ་སྒྱུར་བ་དང་།
en: Some saw him following the sun.

source: ཁ་ཅིག་གིས་ནི་ཤིང་ལེབ་གྱོན་པ་དང་།
en: “Some saw him wearing clothes made of nut palm leaves.

source: ཁ་ཅིག་གིས་ནི་རྩྭ་མུན་ཛའི་གོས་གྱོན་པ་དང་།
en: Some saw him wearing clothes made of muñja grass.

source: ཁ་ཅིག་གིས་ནི་རྩྭ་བལ་པ་ཛའི་གོས་གྱོན་པ་དང་།
en: Some saw him wearing clothes made of balbaja grass.

source: ཁ་ཅིག་གིས་ནི་རྩྭ་ཀུ་ཤའི་གོས་གྱོན་པ་དང་།
en: Some saw him wearing clothes made of kuśa grass.

source: ཁ་ཅིག་གིས་ནི་རི་དགས་ཀྱི་པགས་པ་གྱོན་པ་དང་།
en: Some saw him wearing black antelope skin.

source: ཁ་ཅིག་གིས་ནི་རྩྭ་ཙི་ར་གྱོན་པ་དང་།
en: Some saw him wearing monastic robes.

source: ཁ་ཅིག་གིས་ནི་སྒྲེན་མོར་འདུག་པ་དང་།
en: Some saw him naked.

source: ཁ་ཅིག་གིས་ནི་རྩྭ་དར་བྷའི་གོས་གྱོན་པ་དང་།
en: Some saw him wearing clothes made of darbha grass.

source: ཁ་ཅིག་གིས་ནི་ཤིང་ཤུན་གྱི་གོས་གྱོན་པ་དང་།
en: Some saw him wearing clothes made of tree bark.

source: ཁ་ཅིག་གིས་ནི་སྲེད་ཟ་བ་དང་།
en: “Some saw him eating grains of millet.

source: ཁ་ཅིག་གིས་ནི་ནས་ཟ་བར་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་རྩ་བ་ཟ་བ་དང་། ལོ་མ་ཟ་བ་དང་།
en: Some saw him eating grains of barley.

source: མེ་ཏོག་ཟ་བ་དང་། འབྲས་བུ་ཟ་བ་དང་། སྡོང་བུ་ཟ་བ་དང་། གཟེགས་མ་ཟ་བ་དང་། པདྨའི་རྩ་བ་ཟ་བ་དང་།
en: Some saw him eating roots, leaves, flowers, fruits, shoots, seeds, and lotus roots.

source: ཞག་དྲུག་སྨྱུང་བ་དང་།
en: Some saw him undertaking a six-day fast.

source: ཤ་མི་ཟ་བ་དང་། རྒྱ་ཤུག་ཟ་བ་དང་། ནས་ཤིན་ཏེ་ཟ་བ་དང་། ཅི་ཙེ་ཟ་བ་དང་།
en: Some saw him abstaining from meat.

source: མོན་སྲན་སྡེའུ་ཟ་བ་དང་། མོན་སྲན་གྲེའུ་ཟ་བ་དང་། བྲ་ཡོས་ཟ་བ་དང་། ཏིལ་ཟ་བ་དང་། འབྲས་སྐམ་ཟ་བ་དང་།
en: Some saw him eating jujube fruits, kodo millet, mung beans, māṣa beans, grains of puffed rice, sesame seeds, or grains of uncooked rice.

source: ཆུ་འཐུང་བ་ཙམ་གྱིས་འཚོ་བ་དང་།
en: Some saw him sustaining himself only with water.

source: མར་གྱི་ཐིགས་པ་ཙམ་གྱིས་འཚོ་བ་དང་།
en: Some saw him sustaining himself with drops of ghee.

source: སྦྲང་རྩིའི་ཐིགས་པ་ཙམ་གྱིས་འཚོ་བ་དང་།
en: Some saw him sustaining himself with drops of honey.

source: འོ་མའི་ཐིགས་པ་ཙམ་གྱིས་འཚོ་བ་དང་།
en: Some saw him sustaining himself with drops of milk.

source: ཁ་ཅིག་གིས་ནི་ཟས་མི་ཟ་བ་དང་།
en: Some saw him eating no food at all.

source: ཁ་ཅིག་གིས་ནི་གཉིད་དང་བྲལ་བར་མཐོང་ངོ་། །
en: Some saw him free of fatigue.

source: ཁ་ཅིག་གིས་ནི་འདུག་པ་འབའ་ཤིག་ཏུ་མཐོང་ངོ་། །
en: Some saw him sitting alone.

source: ཁ་ཅིག་གིས་ནི་འགྲེང་བ་འབའ་ཤིག་ཏུ་མཐོང་ངོ་། །
en: Some saw him standing alone.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་ལམ་དེ་དག་དང་། དཀའ་བ་སྤྱོད་པ་ཚད་མེད་པ་གཞན་དག་ཀྱང་སྟོན་ཏེ།
en: “Indeed, Śāntamati, the Bodhisattva displayed severe ascetic practices such as these and an immeasurable number of other demeanors.

source: ལོ་དྲུག་ཚང་བར་སྤྱོད་ལམ་གཅིག་ཀྱང་མ་འཁྲུགས་པར་ཐམས་ཅད་རྫོགས་པར་བསྟན་པར་གྱུར་ཏོ། །བརྟུལ་ཞུགས་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་དང་།
en: For six whole years, not even a single one of his demeanors was disturbed, and all of them were displayed to perfection.

source: བརྩོན་འགྲུས་ཤིན་ཏུ་སྦྱངས་པ་དང་། དཀའ་ཐུབ་ཤིན་ཏུ་བརྟན་པོས་ལོ་དྲུག་ཏུ་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཐམས་ཅད་སྟོན་ཀྱང་སེམས་ཅན་གཞན་དང་གཞན་ལ་མ་མོས་པ་དག་གིས་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་གཞན་དང་གཞན་དུ་མི་མཐོང་སྟེ།
en: With vows of the most distinguished kind, unsurpassable heroic efforts, and the most intense austerities, he displayed all these vows and austerities for six years and he did so in such a way that beings whose inclinations were mutually exclusive to one another did not see the mutually exclusive vows and austerities.

source: གཞན་དུ་ན་ཅི་འདྲ་བའི་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཅི་འདྲ་བ་དག་གིས་སེམས་ཅན་དེ་དག་འདུལ་བར་འགྱུར་བ་དེ་འདྲ་བའི་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་མཐོང་བ་ནི་མ་གཏོགས་སོ། །
en: Instead, those beings saw only the vows and austerities by which they themselves were guided and not the others.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པའི་བཏང་སྙོམས་ཅན་ཡང་ཡིན་ལ་བྱ་བ་དེ་དག་ཀྱང་ཀུན་ཏུ་སྟོན་ཏེ།
en: “In this regard, Śāntamati, the Bodhisattva was irreproachable in every respect and he displayed this activity while being in a state of equanimity.

source: དཀའ་བ་སྤྱོད་པ་འདིས་ལྷ་དང་མི་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Six hundred and forty million gods and humans within the three vehicles were brought to maturity by these severe ascetic practices.

source: ཞི་བའི་བློ་གྲོས་ལྷ་དང་། མི་གང་དག་རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡོངས་སུ་སྦྱོང་བ་བྱས་པ་དེ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ན་འདུག་ཅིང་མཁའ་ཁྱབ་ཀྱི་བསམ་གཏན་ལ་བསམ་གཏན་བྱེད་པ་དང་། མི་གཡོ་བ་དང་། བདེ་བ་མྱོང་བ་དང་། ལོ་དྲུག་ལོན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་པར་མཐོང་ངོ་། །
en: Furthermore, Śāntamati, those gods and humans with lofty aspirations, who had completed the preparations, saw the Bodhisattva sitting in a jeweled pavilion for six years absorbed in the all-pervading meditation, without moving and in a state of bliss, after which the Bodhisattva arose from that meditation.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་ལྷ་དང་མི་ཆོས་ཅན་ཆོས་འདོད་པ་ཆོས་བསྟན་པས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་གང་ཡིན་པ་དེ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལས་གཞན་མི་བྱེད་པར་རྒྱུན་མི་འཆད་པར་ཆོས་སྟོན་པར་མཐོང་སྟེ།
en: “In this regard, Śāntamati, for those gods and humans for whom the important thing is the Dharma, who desire the Dharma, and who need to be brought to maturity through the teaching of the Dharma, they saw the Bodhisattva occupied by no other activity than teaching the Dharma.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་ལ་སྦྱོར་བ། ཡེ་ཤེས་ཆེན་པོ་ཡང་དག་པར་འབྱུང་བ་ཞེས་བྱའོ། །
en: This, Śāntamati, is the practice of great compassion, which is called the coming together of the Bodhisattva’s great knowledge.

source: ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པ་ཞེས་བྱའོ། །
en: It is the gateway to the guiding principles of the Dharma, which is called the descent into the inconceivable.

source: བྱ་དཀའ་བའི་ཡེ་ཤེས་ལ་འཇུག་པ། བདུད་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་འདུལ་བ་ཞེས་བྱའོ། །
en: It is the gateway to the knowledge of what is difficult to do, which is called the overpowering of all Māras and proponents of rival doctrines.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ལོ་དྲུག་ཚང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྐད་སྨོས་པའི་བརྟུལ་ཞུགས་དང་།
en: “When six years had passed in this way, Śāntamati, the Bodhisattva gave up the vows and austerities that he had previously displayed and went to the banks of the Nairañjanā River.

source: དཀའ་ཐུབ་དེ་དག་ལས་ལངས་ཏེ་ཀླུང་ནེ་རན་ཛ་ནའི་འགྲམ་དུ་སོང་ནས་འཇིག་རྟེན་དང་འཐུན་པར་ཁྲུས་བྱས་ཏེ།
en: There he took a bath according to worldly custom.

source: ལུས་གཙང་མར་བྱས་ནས་ཀླུང་ནེ་རན་ཛན་ནས་བྱུང་སྟེ་འདུག་པར་གྱུར་ཏོ། །
en: His body cleansed, he came away from the Nairañjanā River and stayed there.

source: དེ་ན་གྲོང་མིའི་བུ་མོ་ལེགས་སྐྱེས་མ་ཞེས་བྱ་བ་དེས་བ་སྟོང་གི་འོ་མ་བསྐོལ་བ་སྦྲང་རྩི་དང་བསྲེས་པའི་འོ་ཐུག་ཁྱེར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་ངོ་། །གཞན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: A village girl named Sujātā came there holding a bowl of milk rice with honey, which had been made from the boiled milk of a hundred cows, and offered it to the Bodhisattva.

source: དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཡང་རང་རང་གི་ཟས་ཐོགས་ཏེ་འཁོད་ནས་སོ་སོ་ནས་ཚིག་འདི་སྐད་དུ།
en: In addition, six hundred million gods, nāgas, yakṣas, and gandharvas were also standing there, each holding their own particular kinds of food and saying, ‘Good sir!

source: ཀྱེ་སྐྱེས་བུ་དམ་པ་བདག་གི་བཤོས་གསོལ་ཅིག །
en: Please eat my food!

source: ཀྱེ་སྐྱེས་བུ་དམ་པ་བདག་གི་བཤོས་གསོལ་ཅིག་ཅེས་ཟེར་རོ། །
en: Good sir! Please eat my food!’

source: ཞི་བའི་བློ་གྲོས་དེ་ན་བྱང་ཆུབ་སེམས་དཔས་གྲོང་མིའི་བུ་མོ་ལེགས་སྐྱེས་མ་ལ་སོགས་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཁ་ཟས་དེ་དག་བླངས་ནས་ཐམས་ཅད་ཟོས་ཀྱང་ཕན་ཚུན་མ་མཐོང་ངོ་། །
en: “When this occurred, Śāntamati, the Bodhisattva received all the food, beginning with that of the village girl Sujātā, and including the food brought by the six hundred million gods, nāgas, yakṣas, and gandharvas, and he ate all of it.

source: ལྷའི་བུ་རེ་རེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་བཤོས་གསོལ་ཏེ།
en: However, none of them saw the others.

source: བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་བཤོས་གསོལ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་ཤེས་སོ། །དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་པར་གྱུར་ཏེ།
en: Each and every one of them had the understanding ‘the Bodhisattva has taken my food,’ and ‘having eaten my food, the Bodhisattva will awaken to unsurpassable and perfect awakening,’ and all of them were brought to maturity for the sake of their unsurpassable and perfect awakening.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཟས་ལེན་པར་སྦྱོར་བ་དཀའ་བ་སྤྱོད་པ་ཡང་དག་འཕགས་ཞེས་བྱ་བའོ། །
en: “This, Śāntamati, this is the method of bringing beings to maturity by means of acquiring food, which is, indeed, the exalted nature the Bodhisattva’s severe ascetic practices.”

source: ཟས་ལེན་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དཀའ་བ་སྤྱོད་པ་ཡང་དག་འཕགས་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: This was the eleventh chapter, “The Exalted Nature of the Severe Ascetic Practices: The Method of Acquiring Food to Bring Beings to Maturity.” Chapter 12: The Journey to the Seat of Awakening

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལུས་བཀྲུས་ཏེ་ལུས་སྟོབས་དང་ལྡན་པར་གྱུར་ནས་ཟས་ཟོས་ཏེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་ངོ་། །
en: “As soon as the Bodhisattva had washed his body and strength had returned to his body after he had eaten the food, he went to the seat of awakening.

source: དེ་སོང་བ་དང་ས་ལ་སྤྱོད་པའི་ལྷའི་བུས་བཟངས་ཞེས་བྱ་བས་ས་ལ་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་ཅད་ལ་བོས་ཏེ་སྨྲས་པ།
en: An earth-dwelling deity nearby there, named Subhūma, addressed all the earth-dwelling deities, saying:

source: ས་འཛིན་གང་ཞིག་མི་གཡོ་མི་བསྐྱོད་པ། །
en: “ ‘An earth bearer, unwavering and unshakeable,

source: སྲེད་པས་བསལ་ཅིང་ཁོང་ཁྲོ་རབ་སྤངས་པ། །
en: Without craving and devoid of enmity,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཤིང་དྲུང་བྱོན། །
en: The Bodhisattva is approaching that tree.

source: ས་གཞི་དག་ནི་ལེགས་པར་བརྒྱན་པར་བྱ། །
en: I will decorate the surface of the fertile ground.’

source: ལེགས་སོ་ཞེས་ཏེ་ས་ལ་སྤྱོད་རྣམས་དགའ། །
en: “Joyous earth-dwelling deities responded, ‘Great idea!’

source: སྟོང་གསུམ་ཐམས་ཅད་ཡོངས་སུ་ཕྱག་དར་བྱེད། །
en: And cleansed this whole cosmos of a billion worlds,

source: མེ་ཏོག་སིལ་མ་བཀྲམ་ཞིང་སྤོས་མཆོག་བདུགས། །
en: Scattered flowers, burned the most fragrant incense,

source: སྤོས་ཆུ་དག་གིས་ས་གཞི་ཆག་ཆག་བཏབ། །
en: And sprinkled the fertile earth with scented water.

source: ལག་ན་གཞོང་ཐོགས་དེ་བཞིན་ཕྲེང་བ་ཐོགས། །
en: “Bowl-holding deities and, indeed, garland-bearing deities,

source: གཞལ་མེད་ཁང་གནས་དེ་བཞིན་བར་སྣང་བ། །
en: As well as deities who dwell in floating palaces in the sky

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ནས་དགའ། །
en: Were joyous, too, when they looked upon the Bodhisattva,

source: དེ་ཚེ་མེ་ཏོག་སྣ་ཚོགས་ཆར་དུ་ཕབ། །
en: And they showered him with heavenly flowers.

source: གླིང་བཞི་པ་དག་རྣམས་ནི་སྐྱོང་བ་བཞི། །
en: “The lokapālas from the four continents

source: ཇི་སྙེད་པ་དག་ཐམས་ཅད་འཁོར་བཅས་ཏེ། །
en: And, indeed, their whole assemblies

source: རྣམ་པར་འདྲེན་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། །
en: Covered this whole cosmos of a billion worlds

source: གསེར་གྱི་དྲ་བས་སྟོང་གསུམ་ཐམས་ཅད་བཀབ། །
en: With golden nets out of devotion to the Conqueror.

source: སྟོང་གསུམ་འཇིག་རྟེན་བརྒྱ་བྱིན་རྫུ་འཕྲུལ་ཆེ། །དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་མཆོད་པའི་ཕྱིར། །
en: “In this billion-world cosmos, the Śakras, too, possessors of superhuman power,

source: སུམ་ཅུ་རྩ་གསུམ་རྣམ་རྒྱལ་ཁང་མཛེས་པ། །
en: Lit up the Vaijayanta Palaces in the Heavens of the Thirty-Three

source: དེ་ལྟས་སྟོང་གསུམ་ཐམས་ཅད་མཛེས་པར་བརྒྱན། །
en: And similarly made the billion worlds shine and decorated them

source: འཐབ་བྲལ་ལྷ་རྣམས་ཐམས་ཅད་རབ་དགའ་སྟེ། །
en: As an act of veneration of the Bodhisattva. “All the gods of the Yāma Heaven were joyous, too,

source: སྐྱེས་བུ་མཆོག་ལ་ཡང་དག་མཆོད་པའི་ཕྱིར། །
en: And they covered the skies of the billion worlds

source: མི་མཇེད་འཇིག་རྟེན་ཁམས་ཀྱི་སྟོང་གསུམ་ཀུན། །
en: Of this Sahā realm with a net of beryl

source: ནམ་མཁའ་བཻ་དཱུརྱ་ཡི་དྲ་བས་བཀབ། །
en: As an act of veneration of the Supreme Being.

source: དགའ་ལྡན་རབ་དང་དགའ་ལྡན་ལྷ་རྣམས་ཀྱང་། །
en: “The gods of the Heaven of the Contented and their chief

source: དེ་དག་མུ་ཏིག་དྲ་བས་བརྒྱན་པ་བྱས། །
en: Decorated him with a net of pearls,

source: རྒྱན་ཕྲེང་དེ་བཞིན་ཟླ་གམ་རྣམས་ཀྱང་ཐོགས། །
en: And, indeed, adorned him with crescent moons,

source: མུ་ཏིག་སིལ་མའི་ཆར་ཡང་རབ་ཏུ་འབེབས། །
en: And rained upon him a shower of coral and pearls.
